---
kind: type
id: T:Autodesk.Revit.DB.ConnectorJointType
source: html/183a74c2-92fe-e9fd-3757-0f4a2fa519b6.htm
---
# Autodesk.Revit.DB.ConnectorJointType

Connector joint type enum

## Syntax (C#)
```csharp
public enum ConnectorJointType
```